
def area(a):
    '''
    Принимает число a (сторона квадрата), возвращает площадь квадрата.
    
    Параметры:
    a (float): длина стороны квадрата
    
    Возвращаемое значение:
    float: площадь квадрата
    
    Пример вызова:
    area(5)  # возвращает 25
    '''
    return a * a


def perimeter(a):
    '''
    Принимает число a (сторона квадрата), возвращает периметр квадрата.
    
    Параметры:
    a (float): длина стороны квадрата
    
    Возвращаемое значение:
    float: периметр квадрата
    
    Пример вызова:
    perimeter(5)  # возвращает 20
    '''
    return 4 * a
